import React,{useState} from "react";
import { Link } from "react-router-dom";
import Login from "../component/Login";
import "../component/css/todo.css";
import Card from "../component/Card";

function Index() {
  const [cardShow,setCardShow]=useState(false);
  const cardApper = () => {
    setCardShow(true);
  };
  return (
    <>
      <div className="banner d-flex flex-column justify-content-center align-items-center">
        <button className="banner-title" onClick={cardApper}>What TODO do?</button>
      </div>
      <div className="container d-flex justify-content-center">
        <Card
          icon={
            <svg
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              width="55"
              height="55"
              viewBox="0 0 32 32"
            >
              <path
                fill="#637ABF"
                d="M5.187 20.897l3.153-20.283c0.055-0.35 0.354-0.614 0.714-0.614 0.276 0 0.515 0.154 0.637 0.381l0.002 0.004 3.391 6.361zM27.58 25.819l-3.003-18.665c-0.060-0.345-0.357-0.604-0.714-0.604-0.199 0-0.379 0.080-0.51 0.21l0-0-18.933 19.059 10.476 5.904c0.304 0.174 0.669 0.277 1.058 0.277s0.754-0.103 1.069-0.282l-0.011 0.006zM19.067 9.531l-2.427-4.643c-0.123-0.232-0.364-0.387-0.64-0.387s-0.517 0.155-0.638 0.383l-0.002 0.004-10.653 19.091z"
              ></path>
            </svg>
          }
          title={"firebase資料庫"}
          text={
            "採用Firebase作為登入登出系統以及資料庫，提供使用者一個安全性高、可靠的代辦事項管理網頁。"
          }
          animate={cardShow}
        />
        <Card
          icon={
            <svg
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            width="55"
            height="55"
            viewBox="0 0 32 32"
          >
            <path
              fill="#637ABF"
              d="M28 30h-24c-1.104 0-2-0.896-2-2v-21c0-1.104 0.896-2 2-2h2v1c0 1.657 1.343 3 3 3s3-1.343 3-3v-1h8v1c0 1.657 1.344 3 3 3s3-1.343 3-3v-1h2c1.104 0 2 0.896 2 2v21c0 1.104-0.896 2-2 2zM28 12h-24v16h24v-16zM13.069 19.829c0.197-0.314 0.296-0.646 0.296-0.993 0-0.773-0.416-1.16-1.248-1.16-0.723 0-1.414 0.287-2.074 0.861v-1.629c0.73-0.473 1.555-0.709 2.473-0.709 0.859 0 1.53 0.216 2.013 0.647s0.724 1.015 0.724 1.749c0 0.98-0.588 1.994-1.764 3.041l-1.729 1.535v0.035h3.41v1.535h-5.531v-1.441l2.408-2.303c0.484-0.464 0.825-0.853 1.022-1.168zM19.837 23.166c0.264-0.203 0.396-0.486 0.396-0.85 0-0.375-0.163-0.664-0.489-0.867s-0.774-0.305-1.345-0.305h-0.756v-1.418h0.697c1.094 0 1.641-0.363 1.641-1.090 0-0.684-0.42-1.025-1.26-1.025-0.562 0-1.109 0.182-1.641 0.545v-1.512c0.59-0.297 1.277-0.445 2.062-0.445 0.859 0 1.528 0.193 2.007 0.58s0.718 0.889 0.718 1.506c0 1.098-0.557 1.785-1.67 2.062v0.029c0.594 0.074 1.062 0.29 1.406 0.647s0.516 0.796 0.516 1.315c0 0.785-0.287 1.406-0.861 1.863s-1.367 0.686-2.379 0.686c-0.867 0-1.572-0.141-2.115-0.422v-1.611c0.562 0.41 1.219 0.615 1.969 0.615 0.472 0.002 0.84-0.1 1.104-0.303zM22.969 8c-1.088 0-1.969-0.881-1.969-1.969v-2.062c0-1.088 0.881-1.969 1.969-1.969s1.969 0.881 1.969 1.969v2.062c0 1.088-0.881 1.969-1.969 1.969zM8.969 8c-1.088 0-1.969-0.881-1.969-1.969v-2.062c0-1.088 0.881-1.969 1.969-1.969s1.969 0.881 1.969 1.969v2.062c0 1.088-0.882 1.969-1.969 1.969z"
            ></path>
          </svg>
          }
          title={"自製月曆"}
          text={
            "透過月曆介面選擇日期，建立代辦事項，並依照輕重緩急進行分類。讓使用者可以更加有效地規劃自己的工作和生活。"
          }
          animate={cardShow}
        />
        <Card
          icon={
            <svg
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            width="55"
            height="55"
            viewBox="0 0 32 32"
          >
            <path
              fill="#637ABF"
              d="M28 0h-24c-2.2 0-4 1.8-4 4v24c0 2.2 1.8 4 4 4h24c2.2 0 4-1.8 4-4v-24c0-2.2-1.8-4-4-4zM14 24.828l-7.414-7.414 2.828-2.828 4.586 4.586 9.586-9.586 2.828 2.828-12.414 12.414z"
            ></path>
          </svg>
          }
          title={"待辦事項管理"}
          text={
            "使用者可以建立、查看、編輯、刪除自己的代辦事項。讓使用者輕鬆地追蹤自己的進度，並提醒自己將工作和生活平衡安排好。"
          }
          animate={cardShow}
        />
      </div>
    </>
  );
}

export default Index;
